#Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника.
#В расчете необходимо использовать формулу: (выработка в часах*ставка в час) + премия.
#Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.

import my_func
def msg():
    w1, w2, w3 = my_func

    print("Параметр 1: ", w1)
    print("Параметр 2: ", w2)
    print("Параметр 3: ", w3)
print(msg())
