#3. Реализовать функцию my_func(), которая принимает три позиционных аргумента, и возвращает сумму наибольших двух аргументов.

def my_f():
    w1
    w2
    w3
    n =(w1*w2)+w3
    return n
print(my_f())